## Staging: common
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 8 to add, 4 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                         NAME                                                         |
|--------|----------------------------------------------------------------------------------------------------------------------|
| update | `module.notify_slack_critical.module.lambda.aws_lambda_function.this[0]`                                             |
|        | `module.notify_slack_general.module.lambda.aws_lambda_function.this[0]`                                              |
|        | `module.notify_slack_ok.module.lambda.aws_lambda_function.this[0]`                                                   |
|        | `module.notify_slack_warning.module.lambda.aws_lambda_function.this[0]`                                              |
| add    | `module.notify_slack_critical.aws_sns_topic_subscription.sns_notify_slack[0]`                                        |
|        | `module.notify_slack_general.aws_sns_topic_subscription.sns_notify_slack[0]`                                         |
|        | `module.notify_slack_ok.aws_sns_topic_subscription.sns_notify_slack[0]`                                              |
|        | `module.notify_slack_warning.aws_sns_topic_subscription.sns_notify_slack[0]`                                         |
|        | `module.notify_slack_critical.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]` |
|        | `module.notify_slack_general.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`  |
|        | `module.notify_slack_ok.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`       |
|        | `module.notify_slack_warning.module.lambda.aws_lambda_permission.current_version_triggers[&quot;AllowExecutionFromSNS&quot;]`  |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.notify_slack_critical.aws_sns_topic_subscription.sns_notify_slack[0] will be created
  + resource "aws_sns_topic_subscription" "sns_notify_slack" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ca-central-1:239043911459:alert-critical"
    }

  # module.notify_slack_general.aws_sns_topic_subscription.sns_notify_slack[0] will be created
  + resource "aws_sns_topic_subscription" "sns_notify_slack" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ca-central-1:239043911459:alert-general"
    }

  # module.notify_slack_ok.aws_sns_topic_subscription.sns_notify_slack[0] will be created
  + resource "aws_sns_topic_subscription" "sns_notify_slack" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ca-central-1:239043911459:alert-ok"
    }

  # module.notify_slack_warning.aws_sns_topic_subscription.sns_notify_slack[0] will be created
  + resource "aws_sns_topic_subscription" "sns_notify_slack" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = "arn:aws:sns:ca-central-1:239043911459:alert-warning"
    }

  # module.notify_slack_critical.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/18468d9b9b27e11ad9afde31a6a9771f5e726075d8792ba12d455202868bcc35.zip" -> "builds/1e622be40890679d302c03a6096c334d64151aab5aee3e073035598ee5e01db2.zip"
        id                             = "notify-slack-critical"
      ~ last_modified                  = "2024-09-10T19:03:49.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical:10" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-critical:10/invocations" -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.11"
        tags                           = {}
      ~ version                        = "10" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.notify_slack_critical.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "notify-slack-critical"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:sns:ca-central-1:239043911459:alert-critical"
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

  # module.notify_slack_general.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/e8b93d66dbf2c7ef2479acf0c5f9890c23c1fcd432e81da57f3f5b5ec1061753.zip" -> "builds/2c26292ef7673e1f67a17eeecb7e7e2729a987663fdec0eb8f3028fce40d5ab4.zip"
        id                             = "notify-slack-general"
      ~ last_modified                  = "2024-09-10T19:03:49.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-general:8" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-general:8/invocations" -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.11"
        tags                           = {}
      ~ version                        = "8" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.notify_slack_general.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "notify-slack-general"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:sns:ca-central-1:239043911459:alert-general"
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/7877f6dfc99e932437e08c1de7ba322bc1d72a6f3fe5b5c5e8b6eacee4f239eb.zip" -> "builds/c0bc8d02f0098b178b87a31e448515f17dfa6165f117bbeca9526aa66b9266f3.zip"
        id                             = "notify-slack-ok"
      ~ last_modified                  = "2024-09-10T19:03:49.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok:4" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-ok:4/invocations" -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.11"
        tags                           = {}
      ~ version                        = "4" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.notify_slack_ok.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "notify-slack-ok"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:sns:ca-central-1:239043911459:alert-ok"
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

  # module.notify_slack_warning.module.lambda.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/b02ab3a0ae7399c2cfa86e739b9fa00da6ec254197e68e97db7a6f04baae10d0.zip" -> "builds/19863096150fa1a6df6f86bf4faddd68a0875c2a3c199bd42c44f533dcd009d3.zip"
        id                             = "notify-slack-warning"
      ~ last_modified                  = "2024-09-10T19:03:49.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning:10" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ca-central-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ca-central-1:239043911459:function:notify-slack-warning:10/invocations" -> (known after apply)
      ~ runtime                        = "python3.8" -> "python3.11"
        tags                           = {}
      ~ version                        = "10" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.notify_slack_warning.module.lambda.aws_lambda_permission.current_version_triggers["AllowExecutionFromSNS"] will be created
  + resource "aws_lambda_permission" "current_version_triggers" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "notify-slack-warning"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + qualifier           = (known after apply)
      + source_arn          = "arn:aws:sns:ca-central-1:239043911459:alert-warning"
      + statement_id        = "AllowExecutionFromSNS"
      + statement_id_prefix = (known after apply)
    }

Plan: 8 to add, 4 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_s3_bucket.csv_bucket,
  on s3.tf line 5, in resource "aws_s3_bucket" "csv_bucket":
   5: resource "aws_s3_bucket" "csv_bucket" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 65 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.ad_hoc"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.build_tables"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.primary"]
WARN - plan.json - main - Missing Common Tags: ["aws_athena_workgroup.support"]
WARN - plan.json - main - Missing Common Tags: ["aws_budgets_budget.notify_global"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.aws_health[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.route53_resolver_query_log[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_failures_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sns_deliveries_us_west_2[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-inflights-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.bulk-not-being-processed-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.contact-3-500-error-15-minutes-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.document-download-bucket-size-warning[0]"]
WARN - plan.json...
```

</details>
